БИТУправление_медицинским_центром_демо/src/DataProcessors/ЗначенияСвойствОбъекта/ЗначенияСвойствОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗначенияСвойствОбъекта</name>
  <attributes>
    <name>НазначениеСвойств</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораЗначений</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораНазначений</name>
    <type>
      <types>Characteristic.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвойстваИЗначения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>АвтоматическийРасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НазначенияСвойствОбъектов/НазначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенияСвойствОбъектов</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>Boolean</types>
    <types>CatalogRef.Клиенты</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>String</types>
    <types>CatalogRef.Сотрудники</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УдалитьСрокГодности</name>
      <description>(не используется) Срок годности</description>
      <code>00001</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ЗначенияСвойствОбъекта/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак модификаци значений свойств.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЗначенияСвойствМодифицированы() Экспорт

	ТаблицаСвойств = СвойстваИЗначения.Выгрузить();
	ТаблицаСвойств.Колонки.Удалить("НомерСтроки");
	
	ТаблицаЗапроса = ПрочитатьТаблицуСвойствИЗначений();
	// Приведем типы Неопределено к Null.
	Для каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		Для каждого КолонкаТЗ Из ТаблицаЗапроса.Колонки Цикл
			Если СтрокаТЗ[КолонкаТЗ.Имя] = Null Тогда
				СтрокаТЗ[КолонкаТЗ.Имя] = Неопределено;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла; 
	
	Возврат НЕ ОбщегоНазначения.СравнитьТаблицыНаборовЗаписей(ТаблицаЗапроса, ТаблицаСвойств);

КонецФункции // ЗначенияСвойствМодифицированы()

// Процедура заполняет табличную часть обработки свойствами и значениями свойств объекта.
//  При заполнении используются значения реквизитов обработки:
//  ОбъектОтбораЗначений - объект, значения свойств которого отбираются.
//  НазначениеСвойств - значение реквизита, по которому отбораются свойства.
//
Процедура ПрочитатьЗаполнитьСвойстваИЗначения() Экспорт

	СвойстваИЗначения.Загрузить(ПрочитатьТаблицуСвойствИЗначений());
	Для Каждого СтрокаСвойства Из СвойстваИЗначения Цикл
		Если СтрокаСвойства.Значение = Неопределено
			И ЗначениеЗаполнено(СтрокаСвойства.Свойство)
			И СтрокаСвойства.Свойство.ТипЗначения.Типы().Количество() <> 0 
		Тогда
			СтрокаСвойства.Значение = СтрокаСвойства.Свойство.ТипЗначения.ПривестиЗначение(СтрокаСвойства.Значение);
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

// Процедура проверяет, должно ли новое свойство попасть в табличную часть обработки, 
// если да - добавляет свойство и активизирует соответствующую строку в табличном поле.
// Предназначена для вызова из обработчиков форм ОбработкаЗаписиНовогоОбъекта.
//
// Параметры:
//  Свойство - ПланВидовХарактеристикСсылка.СвойстваОбъектов - добавляемое свойство.
//
Процедура ПроверитьДобавитьНовоеСвойство(Свойство) Экспорт

	// Запросом проверяется, должно ли новое свойство быть отобрано в табличную часть.

	Запрос = Новый Запрос();

	Запрос.УстановитьПараметр("Свойство",                Свойство);
	Запрос.УстановитьПараметр("НазначениеСвойств",       НазначениеСвойств);
	Запрос.УстановитьПараметр("СписокНазначенийСвойств", СписокНазначенийСвойств());

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвойстваОбъектов.Ссылка                                     КАК Свойство
	|
	|ИЗ
	|// Отбирается свойство.
	|	(
	|	ВЫБРАТЬ 
	|		ПланВидовХарактеристик.СвойстваОбъектов.Ссылка          КАК Ссылка
	|
	|	ИЗ
	|		ПланВидовХарактеристик.СвойстваОбъектов
	|
	|	ГДЕ
	|		ПланВидовХарактеристик.СвойстваОбъектов.НазначениеСвойства В ( &НазначениеСвойств )
	|		И
	|		ПланВидовХарактеристик.СвойстваОбъектов.Ссылка             = &Свойство
	|
	|	)                                                           КАК СвойстваОбъектов
	|
	|ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ
	|// Присоединяются группы, которым назначено свойство, для отбора свойств.
	|	РегистрСведений.НазначенияСвойствОбъектов
	|ПО
	|	РегистрСведений.НазначенияСвойствОбъектов.Свойство = &Свойство
	|
	|ГДЕ
	|// Свойство должно быть назанчено или всем объектам,
	|// или одной из групп - родителей объекта.
	|	РегистрСведений.НазначенияСвойствОбъектов.Объект ЕСТЬ NULL
	|	ИЛИ
	|	РегистрСведений.НазначенияСвойствОбъектов.Объект В ( &СписокНазначенийСвойств )
	|";

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	// Определение позиции свойства в табличной части.

	Для Индекс = 0 По СвойстваИЗначения.Количество() - 1 Цикл
		Если Свойство.Наименование < СвойстваИЗначения[Индекс].Свойство.Наименование Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Вставка свойства с соответствующую позицию.

	НоваяСтрока = СвойстваИЗначения.Вставить(Индекс);

	НоваяСтрока.ПометкаУдаления = Свойство.ПометкаУдаления;
	НоваяСтрока.Свойство        = Свойство;

КонецПроцедуры

// Функция записывает значения свойств в информационную базу.
// 
// Возвращаемое значение:
//  Булево - успешность записи.
//
Функция ЗаписатьЗначенияСвойств() Экспорт
	
	НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	
	Для каждого Строка Из СвойстваИЗначения Цикл
		Если ЗначениеЗаполнено(Строка.Значение) Тогда
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			
			Запись.Объект   = ОбъектОтбораЗначений;
			Запись.Свойство = Строка.Свойство;
			Запись.Значение = Строка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(ОбъектОтбораЗначений);
	
	Попытка
		НаборЗаписейЗначенияСвойств.Записать();
	Исключение
		#Если Клиент Тогда
			Предупреждение("Не удалось записать значения свойств:" + Символы.ПС + ОписаниеОшибки());
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьТаблицуСвойствИЗначений()
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НазначениеСвойств",       ?(НазначениеСвойств = Неопределено, СвойстваИЗначенияСервер.ПолучитьСписокНазначенийСвойствКатегорийОбъектовПоСсылке(ОбъектОтбораЗначений), НазначениеСвойств));
	Запрос.УстановитьПараметр("ОбъектОтбораЗначений",    ОбъектОтбораЗначений);
	Запрос.УстановитьПараметр("СписокНазначенийСвойств", СписокНазначенийСвойств());
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СвойстваОбъектов.ПометкаУдаления                            КАК ПометкаУдаления,
	|	СвойстваОбъектов.Ссылка                                     КАК Свойство,
	|	СвойстваОбъектов.Наименование                               КАК Наименование,
	|	РегистрСведений.ЗначенияСвойствОбъектов.Значение            КАК Значение,
	|	ВЫБОР КОГДА СвойстваОтбор.НомерСтроки ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК АвтоматическийРасчет
	|
	|ИЗ
	|// Отбираются свойства, предназначенные для заданного типа объектов.
	|	(
	|	ВЫБРАТЬ 
	|		ПланВидовХарактеристик.СвойстваОбъектов.Ссылка          КАК Ссылка,
	|		ПланВидовХарактеристик.СвойстваОбъектов.Наименование    КАК Наименование,
	|		ПланВидовХарактеристик.СвойстваОбъектов.ПометкаУдаления КАК ПометкаУдаления
	|
	|	ИЗ
	|		ПланВидовХарактеристик.СвойстваОбъектов
	|
	|	ГДЕ
	|		ПланВидовХарактеристик.СвойстваОбъектов.НазначениеСвойства В ( &НазначениеСвойств )
	|       И НЕ ПланВидовХарактеристик.СвойстваОбъектов.ПометкаУдаления
	|	)                                                           КАК СвойстваОбъектов
	|
	|ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ
	|// Присоединяются значения свойств, назначенные для заданного объекта.
	|	РегистрСведений.ЗначенияСвойствОбъектов
	|ПО
	|	РегистрСведений.ЗначенияСвойствОбъектов.Свойство = СвойстваОбъектов.Ссылка
	|	И
	|	РегистрСведений.ЗначенияСвойствОбъектов.Объект = &ОбъектОтбораЗначений
	|
	|ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ
	|// Присоединяются группы, которым назначено свойство, для отбора свойств.
	|// Если свойству назначено значение, оно отбирается в любом случае.
	|	РегистрСведений.НазначенияСвойствОбъектов
	|ПО
	|	РегистрСведений.НазначенияСвойствОбъектов.Свойство = СвойстваОбъектов.Ссылка
	|	И
	|	РегистрСведений.ЗначенияСвойствОбъектов.Значение ЕСТЬ NULL
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|ПланВидовХарактеристик.СвойстваОбъектов.Отборы КАК СвойстваОтбор
	|ПО 
	|	СвойстваОтбор.Ссылка = СвойстваОбъектов.Ссылка
	|	И СвойстваОтбор.НомерСтроки = 1
	|
	|ГДЕ
	|// Если значение свойства не задано, свойство должно быть назанчено
	|// или всем объектам, или одной из групп - родителей объекта.
	|	РегистрСведений.НазначенияСвойствОбъектов.Объект ЕСТЬ NULL
	|	ИЛИ
	|	РегистрСведений.НазначенияСвойствОбъектов.Объект В ( &СписокНазначенийСвойств )
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваОбъектов.Наименование
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция формирует список значений, содержащий объект отбора назначений свойств
//  и всех его родителей. Список используется в качестве параметра запросов.
// 
// Возвращаемое значение:
//  CписокЗначений - содержащий объект отбора назначений и всех его родителей.
//
Функция СписокНазначенийСвойств()

	СписокНазначенийСвойств = Новый СписокЗначений;
	ЭтоСправочник = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектОтбораНазначений) Или 
		 ОбъектОтбораНазначений = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() 
	Тогда
		ЭтоСправочник = Метаданные.Справочники.Содержит(ОбъектОтбораНазначений.Метаданные());
	КонецЕсли;
	
	Назначение = ОбъектОтбораНазначений;
	
	Пока ЗначениеЗаполнено(Назначение) Цикл
		
		СписокНазначенийСвойств.Добавить(Назначение);
		
		Если ЭтоСправочник Тогда
			Назначение = Назначение.Родитель;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоСправочник И ОбъектОтбораНазначений.Метаданные().Владельцы.Количество()<>0 И ЗначениеЗаполнено(ОбъектОтбораНазначений.Владелец) Тогда
		СписокНазначенийСвойств.Добавить(ОбъектОтбораНазначений.Владелец);
	КонецЕсли;
	
	Возврат СписокНазначенийСвойств;
	
КонецФункции

#КонецОбласти
